axis2-examples/src/examples/MagicSession/testRequest.soap

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
  <!-- test soap message -->
  <SOAP-ENV:Body>
      <ns1:execute xmlns:ns1="http://ode/bpel/unit-test.wsdl">fire!</ns1:execute>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
